Repository: alexkovalevv/wp-plugin-styleroller-addon
Catalog: langs/styleroller-*.po
Languages: ru_ru

source: Abstract Patterns
ru_ru: Абстрактные

source: Paper & Fabric Patterns
ru_ru: Бумага и ткань

source: Woods Patterns
ru_ru: Древесные

source: Retro Patterns
ru_ru: Ретро

source: Please, activate the plugin to get started. Enter a key you received with the plugin into the form below.
ru_ru: Чтобы приступить к работе, пожалуйста, введите ваш лицензионный ключ, который вы получили при покупки, в поле ниже.

source: Default
ru_ru: По умолчанию

source: StyleRoller Add-on
ru_ru: Дополнение StyleRoller

source: The StyleRoller Add-on is activated but the plugin Social Locker is not found. Please activate the Social Locker or deactivate the StyleRoller.
ru_ru: Для работы дополнения StyleRoller требуется плагин Социальный Замок. Пожалуйста, активируйте плагин Социальный Замок или деактивируйте дополнение StyleRoller.

source: The StyleRoller Add-on requires Social Locker %s. Please update the plugin Social Locker.
ru_ru: Для работы дополнения StyleRoller требуется плагин Социальный Замок %s. Пожалуйста, обновите плагин Социальный замок.

source: StyleRoller Add-On
ru_ru: Дополнение StyleRoller

source: The StyleRoller adds a new option called "Style" for all the locker themes.
ru_ru: StyleRoller добавляет новую опцию под название "Стиль" для тем всех оформления.

source: Every theme has own set of styles. The "style" means a modified locker look based on one of the themes.
ru_ru: Каждая тема имеет свой набор стилей. "Стиль" - это вариант оформления, который берет за основу одну из базовых тем.

source: How to create a new style?
ru_ru: Как создать новый стиль для Социального замка?

source: Open to edit any of your lockers. At the right of the dropdown list "Theme", you will find another dropdown list which contains only one item with the name "Default".
ru_ru: Откройте мастер настройки для любого Замка. Справа от списка "Тема" теперь находится новый выпадающий список с одним пунктом "По умолчанию".

source: Click the Plus button to run the StyleRoller and create a new style.
ru_ru: Нажмите на кнопку "Плюс", чтобы создать новый стиль.

source: When you create a new style for one of the themes, the StyleRoller clones an initial look of a selected theme.
ru_ru: Когда вы создаете новый стиль, StyleRoller клонирует изначальный внешний вид выбранной темы оформления.

source: View the short video below to get overal undestanding how the StyleRoller works:
ru_ru: Просмотрите видео ниже, чтобы получить общее представление о том как работает StyleRoller:

source: How to edit an exising style?
ru_ru: Как отредактировать существующий стиль?

source: When you have created and saved a new style, you can edit it at any time. Click the Pencil button to make that.
ru_ru: После того как вы создали и сохранили новый стиль, вы можете вернуться к нему в любой момент, чтобы отредактировать. Просто нажмите на кнопку с "Карандаш", чтобы сделать это.

source: Note that you cannot edit the Default styles in order to prevent overwriting initial looks.
ru_ru: Обратите внимание, что вы не можете редактировать стили "По умолчанию", чтобы избежать потери исходных тем оформления.

source: Why does every theme have its own set of editable options?
ru_ru: Почему каждая темы имеет свои набор параметров для редактирования?

source: Yes, every of the themes has its own set of options. The first reason is that this way allows to simplify the process of editing styles and focus on the most important options of a given theme.
ru_ru: Первая причина, почему это сделано - это позволяет упростить редактирование тем и сфокусироваться на наиболее важных параметрах для данной темы.

source: The second reason is that we're going to release other themes in future. These themes will have non-standard look and feel. One of the future themes is the theme called "Blurred".
ru_ru: Вторая причина - в будущем мы собираемся выпустить дополнительные темы. Эти темы будут иметь совершенно другую структуру, их нельзя будет подвести под единый способ настройки.

source: To keep editing easy and save an ability to add non-standard themes in the future, the StyleRoller offers different options to edit for each theme.
ru_ru: Чтобы сохранить простоту редактировать и возможность работать с нестандартными темами оформления, StyleRoller отображает различные настройки для каждой из тем.

source: New Style
ru_ru: Новый стиль

source: Sorry, editing the default styles is not allowed.
ru_ru: К сожалению, редактирование стилей по умолчанию невозможно.

source: Select elemens to customize:
ru_ru: Выберите элемент для настройки:

source: Save
ru_ru: Сохранить

source: Close
ru_ru: Закрыть

source: Delete
ru_ru: Удалить

source: Sorry, it's not possible
ru_ru: Извините, это невозможно.

source: You're trying delete the default style for one of themes. Sorry, it's not possible.
ru_ru: Вы пытаетесь удалить стиль по умолчанию для одной из тем. Извините, это нельзя сделать.

source: Deleting Style
ru_ru: Удаление стиля

source: Are you sure you want to delete this style?
ru_ru: Вы уверены что хотите удалить этот стиль?

source: Cancel
ru_ru: Отмена

source: Yes, I'm sure
ru_ru: Да, я уверен

source: This style is used by one of lockers. Please select a style that will be used as a replacement for them.
ru_ru: Этот стиль используется одним из Социальных замков. Пожалуйста, выберите стиль, который будет использоваться как замена для стиля, который вы удаляете.

source: Ok, replace and delete
ru_ru: Заменить и удалить
